minecraftGman/KaosDual/esp32/sdkconfig.defaults
# Target: classic ESP32
CONFIG_IDF_TARGET="esp32"

# UART0 is used for flashing/monitor, we use UART2 for the proxy protocol
# (so you can still see logs on UART0 while the proxy runs on UART2)

# FatFS long filenames
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENABLED=y

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# NVS (needed by WiFi)
CONFIG_NVS_ENCRYPTION=n

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Logging level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
